Documents/УДАЛИТЬ_НастройкаНачисленийБонусовПоПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_НастройкаНачисленийБонусовПоПродажам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НастройкиНачисленияБонусовПоПродажам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовНачисленияБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонусПроцентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаПоВидамНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНачислятьБонусы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСуммой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПроцентом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаПоНоменклатуре</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНачислятьБонусы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСуммой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПроцентом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаИКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_НастройкаНачисленийБонусовПоПродажам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьФормуДокумента()
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Элементы.НастройкаПоВидамНоменклатурыБонусСуммой.Заголовок = "" + ВалютаУчета + " за единицу товара";
	Элементы.НастройкаПоНоменклатуреБонусСуммой.Заголовок = "" + ВалютаУчета + " за единицу товара";
	
	Если Объект.НастройкаПоВидамНоменклатуры.Количество() = 0 Тогда
		Элементы.ГруппаНастройкаПоВидамНоменклатуры.Заголовок = "По виду номенклатуры";
	Иначе
		Элементы.ГруппаНастройкаПоВидамНоменклатуры.Заголовок = "По виду номенклатуры ("+Объект.НастройкаПоВидамНоменклатуры.Количество()+")";
	КонецЕсли;
	Если Объект.НастройкаПоНоменклатуре.Количество() = 0 Тогда
		Элементы.ГруппаНастройкаПоНоменклатуре.Заголовок = "Номенклатура";
	Иначе
		Элементы.ГруппаНастройкаПоНоменклатуре.Заголовок = "Номенклатура ("+Объект.НастройкаПоНоменклатуре.Количество()+")";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() или не Объект.Проведен Тогда
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьФормуДокумента();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, "НастройкаПоНоменклатуреНоменклатураАртикул");

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура НастройкаПоВидамНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоВидамНоменклатурыПослеУдаления(Элемент)
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоНоменклатуреПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоНоменклатуреПослеУдаления(Элемент)
	ОбновитьФормуДокумента();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверки перед проведением
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//проверим на задвоения - вид номенклатуры
		ВремТаблица = Новый ТаблицаЗначений;
		ВремТаблица = Объект.НастройкаПоВидамНоменклатуры.Выгрузить();
		ВремТаблица.Колонки.Добавить("Количество");
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			ТекущаяСтрока.Количество = 1;
		КонецЦикла;
		ВремТаблица.Свернуть("ВидНоменклатуры, Категория","Количество");
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			Если ТекущаяСтрока.Количество > 1 Тогда
				Сообщить("В таблице настройки по видам номенклатуры задвоены записи по виду """ + ТекущаяСтрока.ВидНоменклатуры + """");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//проверим на задвоения - номенклатура
		ВремТаблица = Новый ТаблицаЗначений;
		ВремТаблица = Объект.НастройкаПоНоменклатуре.Выгрузить();
		ВремТаблица.Колонки.Добавить("Количество");
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			ТекущаяСтрока.Количество = 1;
		КонецЦикла;
		ВремТаблица.Свернуть("Номенклатура","Количество");
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			Если ТекущаяСтрока.Количество > 1 Тогда
				Сообщить("В таблице настройки по номенклатуре задвоены записи по """ + ТекущаяСтрока.Номенклатура + """");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//вид номенклатуры - в строке должно быть что-то одно - или процент или сумма
		Для Каждого ТекущаяСтрока Из Объект.НастройкаПоВидамНоменклатуры Цикл
			Если НЕ ТекущаяСтрока.БонусСуммой = 0 И НЕ ТекущаяСтрока.БонусПроцентом = 0 Тогда
				Сообщить("В таблице по видам номенклатуры в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " для вида """+ТекущаяСтрока.ВидНоменклатуры+""" указано начислять бонусы и по сумме и по % от продаж. Необходимо оставить только один из параметров.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		//номенклатура - в строке должно быть что-то одно - или процент или сумма
		Для Каждого ТекущаяСтрока Из Объект.НастройкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.БонусСуммой = 0 И НЕ ТекущаяСтрока.БонусПроцентом = 0 Тогда
				Сообщить("В таблице по номенклатуре в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " для номенклатуры """+ТекущаяСтрока.Номенклатура+""" указано начислять бонусы и по сумме и по % от продаж. Необходимо оставить только один из параметров.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из Объект.НастройкаПоВидамНоменклатуры Цикл
			Если НЕ ТекущаяСтрока.Категория.Пустая() и ТекущаяСтрока.ВидНоменклатуры.Пустая() Тогда
				Сообщить("В таблице по видам номенклатуры в строке №" + СтрЗаменить(ТекущаяСтрока.НомерСтроки,Символ(160),"") + " указана категория, но не указан вид номенклатуры. Укажите вид номенклатуры");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Отказ Тогда
			Сообщить("Проведение документа отменено.");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоВидамНоменклатурыНеНачислятьБонусыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкаПоВидамНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьБонусы Тогда
		ТекущиеДанные.БонусСуммой = 0;
		ТекущиеДанные.БонусПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПоНоменклатуреНеНачислятьБонусыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкаПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные.НеНачислятьБонусы Тогда
		ТекущиеДанные.БонусСуммой = 0;
		ТекущиеДанные.БонусПроцентом = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	ГруппаНоменклатуры = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбораГруппы");
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда 
		ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура";
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Сообщить ("Выбранная папка Номенклатуры пустая", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = Объект.НастройкаПоНоменклатуре.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачислятьПоВсем(Команда)
	Для Каждого ТекущаяСтрока Из Объект.НастройкаПоНоменклатуре Цикл
		ТекущаяСтрока.НеНачислятьБонусы = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеНачислятьВсем(Команда)
	Для Каждого ТекущаяСтрока Из Объект.НастройкаПоНоменклатуре Цикл
		ТекущаяСтрока.НеНачислятьБонусы = Истина;
		ТекущаяСтрока.БонусСуммой = 0;
		ТекущаяСтрока.БонусПроцентом = 0;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьЗаЕдиницу(Команда)
	ОповещениеПослеВВодаСтоимостиЗаЕдиницу = Новый ОписаниеОповещения("ПослеВВодаСтоимостиЗаЕдиницу",ЭтаФорма);
	ПоказатьВводЧисла(ОповещениеПослеВВодаСтоимостиЗаЕдиницу,0,"Введите сумму бонуса за единицу товара",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВВодаСтоимостиЗаЕдиницу(Число, Параметры) Экспорт
    Если НЕ Число = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из Объект.НастройкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.НеНачислятьБонусы Тогда
				ТекущаяСтрока.БонусСуммой = Число;
			КонецЕсли;
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьЗаСумму(Команда)
	ОповещениеПослеВВодаСтоимостиЗаСумму = Новый ОписаниеОповещения("ПослеВВодаСтоимостиЗаСумму",ЭтаФорма);
	ПоказатьВводЧисла(ОповещениеПослеВВодаСтоимостиЗаСумму,0,"Введите размер в % от суммы продаж для начисления бонусов",15,2);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВВодаСтоимостиЗаСумму(Число, Параметры) Экспорт
    Если НЕ Число = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из Объект.НастройкаПоНоменклатуре Цикл
			Если НЕ ТекущаяСтрока.НеНачислятьБонусы Тогда
				ТекущаяСтрока.БонусПроцентом = Число;
			КонецЕсли;
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
	ПривестиТипКассыСчетаВСоответствие();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаПоОплатам.Видимость = Ложь;
	Элементы.Страницы.Видимость = Ложь;
	
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг") Тогда
		Элементы.Страницы.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоОплатам.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
	ПривестиТипКассыСчетаВСоответствие();
КонецПроцедуры

&НаКлиенте
Процедура ПривестиТипКассыСчетаВСоответствие()
	
	ОписаниеТипов = новый ОписаниеТипов("СправочникСсылка.Кассы");
	Элементы.СчетаИКассыСчетКасса.Заголовок = "Касса";
	
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовНачисленияБонусов.ПоступлениеНаРасчетныйСчет") Тогда
		ОписаниеТипов = новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Элементы.СчетаИКассыСчетКасса.Заголовок = "Счет";
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой") Тогда	
		ОписаниеТипов = новый ОписаниеТипов("СправочникСсылка.ЭквайринговыеТерминалы");
		Элементы.СчетаИКассыСчетКасса.Заголовок = "Эквайринговый терминал";
	КонецЕсли;	
	
	Элементы.СчетаИКассыСчетКасса.ВыбиратьТип = Ложь;
	Элементы.СчетаИКассыСчетКасса.ОграничениеТипа = ОписаниеТипов;
	
КонецПроцедуры
